
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 2 to change, 1 to destroy.</code></pre>

* Create
  * module.alert-action-group.azurerm_resource_group_template_deployment.action-group
  * module.vault.azurerm_key_vault_access_policy.implicit_managed_identity_access_policy[0]
  * module.vault.azurerm_user_assigned_identity.managed_identity[0]
* Update
  * module.vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.vault.azurerm_monitor_diagnostic_setting.kv-ds
* Delete
  * module.alert-action-group.azurerm_template_deployment.action-group


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.alert-action-group.azurerm_resource_group_template_deployment.action-group will be created
  + resource "azurerm_resource_group_template_deployment" "action-group" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "BSP_alert"
      + output_content      = (known after apply)
      + parameters_content  = (sensitive)
      + resource_group_name = "bulk-scan-aat"
      + template_content    = jsonencode(
            {
              + $schema        = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + actionGroupName      = {
                      + type = "string"
                    }
                  + emailReceiverAddress = {
                      + metadata = {
                          + description = "Email address of the receiver"
                        }
                      + type     = "string"
                    }
                  + emailReceiverName    = {
                      + metadata = {
                          + description = "Name of the email receiver"
                        }
                      + type     = "string"
                    }
                  + location             = {
                      + defaultValue = "global"
                      + type         = "string"
                    }
                  + shortName            = {
                      + type = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2017-04-01"
                      + location   = "[parameters('location')]"
                      + name       = "[parameters('actionGroupName')]"
                      + properties = {
                          + emailReceivers   = [
                              + {
                                  + emailAddress = "[parameters('emailReceiverAddress')]"
                                  + name         = "[parameters('emailReceiverName')]"
                                },
                            ]
                          + enabled          = true
                          + groupShortName   = "[parameters('shortName')]"
                          + smsReceivers     = []
                          + webhookReceivers = []
                        }
                      + tags       = {}
                      + type       = "microsoft.insights/actionGroups"
                    },
                ]
            }
        )
    }

  # module.alert-action-group.azurerm_template_deployment.action-group will be destroyed
  # (because azurerm_template_deployment.action-group is not in configuration)
  - resource "azurerm_template_deployment" "action-group" {
      - deployment_mode     = "Incremental" -> null
      - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.Resources/deployments/BSP_alert_aat" -> null
      - name                = "BSP_alert_aat" -> null
      - outputs             = {} -> null
      - parameters          = {
          - "actionGroupName"      = "BSP Alert (aat)"
          - "emailReceiverAddress" = (sensitive)
          - "emailReceiverName"    = "BSP Alerts And Monitoring"
          - "location"             = "global"
          - "shortName"            = "BSP_alert"
        } -> null
      - resource_group_name = "bulk-scan-aat" -> null
      - template_body       = jsonencode(
            {
              - $schema        = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - actionGroupName      = {
                      - type = "string"
                    }
                  - emailReceiverAddress = {
                      - metadata = {
                          - description = "Email address of the receiver"
                        }
                      - type     = "string"
                    }
                  - emailReceiverName    = {
                      - metadata = {
                          - description = "Name of the email receiver"
                        }
                      - type     = "string"
                    }
                  - location             = {
                      - defaultValue = "global"
                      - type         = "string"
                    }
                  - shortName            = {
                      - type = "string"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2017-04-01"
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('actionGroupName')]"
                      - properties = {
                          - emailReceivers   = [
                              - {
                                  - emailAddress = "[parameters('emailReceiverAddress')]"
                                  - name         = "[parameters('emailReceiverName')]"
                                },
                            ]
                          - enabled          = true
                          - groupShortName   = "[parameters('shortName')]"
                          - smsReceivers     = []
                          - webhookReceivers = []
                        }
                      - tags       = {}
                      - type       = "microsoft.insights/actionGroups"
                    },
                ]
            }
        ) -> null
    }

  # module.vault.azurerm_key_vault_access_policy.implicit_managed_identity_access_policy[0] will be created
  + resource "azurerm_key_vault_access_policy" "implicit_managed_identity_access_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.KeyVault/vaults/bulk-scan-aat"
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.vault.azurerm_key_vault_access_policy.product_team_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      ~ certificate_permissions = [
            # (10 unchanged elements hidden)
            "DeleteIssuers",
          + "Recover",
        ]
        id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.KeyVault/vaults/bulk-scan-aat/objectId/70de400b-4f47-4f25-a4f0-45e1ee4e4ae3"
      ~ key_permissions         = [
            # (4 unchanged elements hidden)
            "Delete",
          + "Recover",
        ]
      ~ secret_permissions      = [
            # (2 unchanged elements hidden)
            "Delete",
          + "Recover",
        ]
        # (4 unchanged attributes hidden)
    }

  # module.vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.KeyVault/vaults/bulk-scan-aat|bulk-scan-aat"
        name                       = "bulk-scan-aat"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
        # (1 unchanged block hidden)
    }

  # module.vault.azurerm_user_assigned_identity.managed_identity[0] will be created
  + resource "azurerm_user_assigned_identity" "managed_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "bulk-scan-aat-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-aat-rg"
      + tags                = {
          + "BuiltFrom"           = "https://github.com/HMCTS/bulk-scan-shared-infrastructure.git"
          + "application"         = "bulk-scan-print"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "staging"
          + "managedBy"           = "Bulk Scanning and Printing"
        }
      + tenant_id           = (known after apply)
    }

Plan: 3 to add, 2 to change, 1 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_key_vault_secret.app_insights_connection_string has changed
  ~ resource "azurerm_key_vault_secret" "app_insights_connection_string" {
        id             = "https://bulk-scan-aat.vault.azure.net/secrets/app-insights-connection-string/ce8faefba18f4fe6aa361516fd8a77cf"
        name           = "app-insights-connection-string"
      + tags           = {}
        # (5 unchanged attributes hidden)
    }

  # azurerm_storage_account.storage_account has changed
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.Storage/storageAccounts/bulkscanaat"
        name                              = "bulkscanaat"
        tags                              = {
            "BuiltFrom"           = "https://github.com/HMCTS/bulk-scan-shared-infrastructure.git"
            "application"         = "bulk-scan-print"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
        }
        # (33 unchanged attributes hidden)


      ~ network_rules {
          ~ ip_rules                   = [
              + "82.42.169.18",
                # (1 unchanged element hidden)
            ]
            # (3 unchanged attributes hidden)
        }

      ~ queue_properties {

          ~ hour_metrics {
              ~ retention_policy_days = 7 -> 31
                # (3 unchanged attributes hidden)
            }

          ~ logging {
              ~ delete                = false -> true
              ~ read                  = false -> true
              ~ retention_policy_days = 0 -> 31
              ~ write                 = false -> true
                # (1 unchanged attribute hidden)
            }

          ~ minute_metrics {
              ~ enabled               = false -> true
              ~ include_apis          = false -> true
              ~ retention_policy_days = 0 -> 5
                # (1 unchanged attribute hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_storage_account.storage_account_staging has changed
  ~ resource "azurerm_storage_account" "storage_account_staging" {
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.Storage/storageAccounts/bulkscanaatstaging"
        name                              = "bulkscanaatstaging"
        tags                              = {
            "BuiltFrom"           = "https://github.com/HMCTS/bulk-scan-shared-infrastructure.git"
            "application"         = "bulk-scan-print"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
        }
        # (33 unchanged attributes hidden)



      ~ queue_properties {

          ~ hour_metrics {
              ~ retention_policy_days = 7 -> 31
                # (3 unchanged attributes hidden)
            }

          ~ logging {
              ~ delete                = false -> true
              ~ read                  = false -> true
              ~ retention_policy_days = 0 -> 31
              ~ write                 = false -> true
                # (1 unchanged attribute hidden)
            }

          ~ minute_metrics {
              ~ enabled               = false -> true
              ~ include_apis          = false -> true
              ~ retention_policy_days = 0 -> 5
                # (1 unchanged attribute hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.vault.azurerm_key_vault.kv has changed
  ~ resource "azurerm_key_vault" "kv" {
      ~ access_policy                   = [
            # (8 unchanged elements hidden)
            {
                application_id          = ""
                certificate_permissions = [
                    "Get",
                    "List",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                ]
                object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
                secret_permissions      = [
                    "Get",
                    "List",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          + {
              + application_id          = ""
              + certificate_permissions = []
              + key_permissions         = []
              + object_id               = "626041d7-1bf3-46ca-84b6-28b6b0c60efe"
              + secret_permissions      = [
                  + "List",
                  + "Get",
                ]
              + storage_permissions     = []
              + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
        ]
        id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.KeyVault/vaults/bulk-scan-aat"
        name                            = "bulk-scan-aat"
        tags                            = {
            "BuiltFrom"           = "https://github.com/HMCTS/bulk-scan-shared-infrastructure.git"
            "application"         = "bulk-scan-print"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vault.azurerm_monitor_diagnostic_setting.kv-ds has changed
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.KeyVault/vaults/bulk-scan-aat|bulk-scan-aat"
        name                       = "bulk-scan-aat"
        # (2 unchanged attributes hidden)

      + log {
          + category = "AzurePolicyEvaluationDetails"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":273,"Program":"tfcmt","SHA1":"","Vars":{}} -->